---
kind: property
id: P:Autodesk.Revit.DB.Element.ViewSpecific
zh: 构件、图元、元素
source: html/785b351e-51cb-e3c6-cb91-f307c8e4ba73.htm
---
# Autodesk.Revit.DB.Element.ViewSpecific Property

**中文**: 构件、图元、元素

Identifies if the element is owned by a view.

## Syntax (C#)
```csharp
public bool ViewSpecific { get; }
```